## Pandas Data Frames

- What Is Pandas?
- Pandas vs Numpy 
- Pandas Data Frame Intro
- Pandas Data Frame fundamental operations
    - Creating
    - Selecting/indexing
    - Inserting rows/columns
    - Setting data
    - Filtering
    - dropping rwos/ columns
- Dealing with Missing values

In [ ]:
%matplotlib inline
import numpy as np
import pandas as pd
from IPython.display import Image
from IPython.display import HTML
from IPython.display import Markdown, display
def printmd(string):
    display(Markdown(string))

In [ ]:
CSS = """
.output {
    align-items: center;
}
"""
HTML('''<script>
code_show=true; 
function code_toggle() {
 if (code_show){
 $('div.input').hide();
 } else {
 $('div.input').show();
 }
 code_show = !code_show
} 
$( document ).ready(code_toggle);
</script>
<form action="javascript:code_toggle()"><input type="submit" value="Code mode"></form>''')

In [ ]:
from IPython.display import display,Image, HTML

CSS = """
.output {
    align-items: center;
}
div.output_area {
    width: 80%;
}
"""
HTML('<style>{}</style>'.format(CSS))

# What is Pandas?

### - Enables working with tabular and labeled data easily and intuitively
### - Pandas is an open-source library built on top of Numpy Package.
- https://github.com/pandas-dev/pandas
- https://github.com/pandas-dev/pandas/blob/059c8bac51e47d6eaaa3e36d6a293a22312925e6/pandas/core/frame.py

### - Pandas data structures are:
    - Series
    - Index
    - Data Frame

## Quick refresh to Numpy Arrays..
- contains Numerical ***Homogonius*** Data
- may contain multi dimensional array elements.
- used for performing various numerical computations and processing of the multidimensional and single-dimensional array elements.

In [ ]:
import numpy as np
np.random.seed(0)  # seed for reproducibility

two_dim_arr = np.random.randint(10, size=(3, 4))  # Two-dimensional array
three_dim_arr = np.random.randint(10, size=(3, 4, 5))  # Three-dimensional array

### A two dimensional Array example...

In [ ]:
print("Two Dimentional Array")
two_dim_arr

### What I mean by Homogeneous...

In [ ]:
print(two_dim_arr)

**two_dim_arr[0,0] = "Hello"**

In [ ]:
#printmd("***Oops....***")
two_dim_arr[0,0] = "Hello"

### You can directly and simply form the DataFrame from the 2D array

In [6]:
import pandas as pd

In [28]:

print("Data Frame formed by 2D Array")
#printmd("***df=pd.DataFrame(two_dim_arr)***")
df=pd.DataFrame(two_dim_arr)
df

Data Frame formed by 2D Array

   0  1  2  3
0  5  0  3  3
1  7  9  3  5
2  2  4  7  6

### Pandas Data Frame is Heterogeneous!
**df.iloc[0,0]="Hello"**

In [30]:
df.iloc[0,0]=np.nan
df

     0  1  2  3
0  NaN  0  3  3
1  7.0  9  3  5
2  2.0  4  7  6

In [34]:
df.astype(dtype=float)

     0    1    2    3
0  NaN  0.0  3.0  3.0
1  7.0  9.0  3.0  5.0
2  2.0  4.0  7.0  6.0

In [37]:
names = [ "Leo", "Ajay"]
age = [ 31, 29 ]
pet = [ "Freddy", "Racoon"]

students = pd.DataFrame(names, age, pet,
                       columns = ["names", "age", "pet"]
                       )

TypeError: __init__() got multiple values for argument 'columns'

### Pandas Data Frame labels the data with Indices and Columns labels
pd.DataFrame(np.random.randint(10,size=(3,2)),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

In [ ]:
np.random.randint(10,size=(3,2))

In [ ]:
##np.random.seed(0)
foo_df=pd.DataFrame(np.random.randint(10,size=(3,2)),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c']
                   )

In [ ]:
foo_df

In [ ]:
foo_df

### Pandas DataFrame is relevant for statistical observations/data points with various variables (categorical, etc)

In [ ]:
Image("res/Tidy_census.png")

### It is intuitive...  Look how convenient it is!!

In [ ]:
people_df= pd.read_csv("data/people.csv")
people_df

In [ ]:
Image('res/excel-to-pandas.png')

source: https://jalammar.github.io/

### Describing the Data Frame...
- df.Info()
- df.count())
- df.describe())
- df.mean())

In [ ]:
people_df

In [ ]:
people_df.info()

In [ ]:
people_df.describe()

In [ ]:
people_df.count()

In [ ]:
x=[1,3,4,50]
print(np.median(x))
print(np.mean(x))

In [ ]:
#print(df,"\n")
people_df.info()
#print("df.count()  \n",df.count())
#print("\n df.describe() \n",df.describe())
#print("\n df.mean() \n",df.mean())

### Pandas Data Frame operations

In [ ]:
Image("res/CRUD.png")

### Data Frame creation
You can create/form a Data Frame from:
- Dict of 1D ndarrays, lists, dicts, or Series

- 2-D numpy.ndarray

- Structured or record ndarray

- A Series

- Another DataFrame

#### Here is an example...

In [38]:
print('dic = {"col1": [1.0, 2.0, 3.0, 4.0], "col2": [4.0, 3.0, 2.0, 1.0]}\n')

dic = {"col1": [1.0, 2.0, 3.0, 4.0], "col2": [4.0, 3.0, 2.0, 1.0]}

dic

dic = {"col1": [1.0, 2.0, 3.0, 4.0], "col2": [4.0, 3.0, 2.0, 1.0]}

{'col1': [1.0, 2.0, 3.0, 4.0], 'col2': [4.0, 3.0, 2.0, 1.0]}

In [39]:
df=pd.DataFrame(dic)

#### creating Index for the Data frame...

In [43]:
df2=pd.DataFrame(dic)
df2

   col1  col2
0   1.0   4.0
1   2.0   3.0
2   3.0   2.0
3   4.0   1.0

In [51]:
index = [1,2,3,4,5,6,7]
df3 = pd.concat([df, df2], axis=0).reset_index()
df3
df3.reindex(index)

  index  col1  col2
1     b   2.0   3.0
2     c   3.0   2.0
3     d   4.0   1.0
4     0   1.0   4.0
5     1   2.0   3.0
6     2   3.0   2.0
7     3   4.0   1.0

In [41]:
np.array(df["col1"])

array([1., 2., 3., 4.])

### Creating Data frame from Pandas Series objects..

In [ ]:
d = {
       "apples": [3, 2, 0,1],
        "oranges": [0, 3, 7, 2],
    }

pd.DataFrame(d)

In [ ]:
Image("res/series-and-dataframe.width-1200.png")

source: https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png

### Data Frame Selection / Indexing

In [52]:
data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
             'Manchester', 'Cairo', 'Osaka'],
    'age': [41, 28, 33, 34, 38, 31, 37],
    'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
}

row_labels = [101, 102, 103, 104, 105, 106, 107]
students_df = pd.DataFrame(data=data, index=row_labels)
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [53]:
students_df.index

Int64Index([101, 102, 103, 104, 105, 106, 107], dtype='int64')

Source: https://realpython.com/

### data Selection

In [54]:
students_df.loc[[101],["age"]]

     age
101   41

In [55]:
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

### Selecting by Label
- .loc[]  function

In [ ]:
#print("students_df.loc[:, 'city']")
#students_df.loc[:, 'city']

In [56]:
print("students_df.loc[102:106, ['name', 'city']]")
students_df.loc[102,:]

students_df.loc[102:106, ['name', 'city']]

name            Ann
city        Toronto
age              28
py-score       79.0
Name: 102, dtype: object

In [57]:
#print('df["city"]')
cities = students_df[["age","city"]]
cities

     age         city
101   41  Mexico City
102   28      Toronto
103   33       Prague
104   34     Shanghai
105   38   Manchester
106   31        Cairo
107   37        Osaka

In [ ]:
print("df.city")
students_df.city

### Selecting by Position
- .iloc[]

In [58]:
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [60]:
students_df.iloc[0,1]

'Mexico City'

In [63]:
print("students_df.iloc[1:6, [0, 1]]")
students_df.iloc[1:6, [0, 1]]

students_df.iloc[1:6, [0, 1]]

      name        city
102    Ann     Toronto
103   Jana      Prague
104     Yi    Shanghai
105  Robin  Manchester
106   Amal       Cairo

### Hmm.. Can you tell what is the difference between loc and iloc?

### Setting/ Updating data

#### let us first update the Data frame index..

In [ ]:
students_df

In [ ]:
students_df.index = list(np.arange(0, 7))
students_df

In [ ]:
students_df=students_df.reset_index()

In [ ]:
students_df.index

In [ ]:
students_df.iloc[:4, 4] = [40, 50, 60, 70]
students_df

In [ ]:
students_df.loc[5, 'py-score']

In [ ]:
students_df.loc[5, 'py-score'] = 70
students_df

In [64]:
students_df.loc[:,"py-score"]=90 
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41        90
102     Ann      Toronto   28        90
103    Jana       Prague   33        90
104      Yi     Shanghai   34        90
105   Robin   Manchester   38        90
106    Amal        Cairo   31        90
107    Nori        Osaka   37        90

In [68]:
students_df.iloc[:, -1] = [88.0, 90, 81.0, 80.0, 68.0, 61.0, 84.0]
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      90.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [ ]:
students_df["py-score"]="Adam-score"
students_df

In [ ]:
students_df

In [ ]:
students_df.info()

In [69]:
students_df["py-score"]=students_df["py-score"]  * 1.5

In [70]:
students_df

       name         city  age  py-score
101  Xavier  Mexico City   41     132.0
102     Ann      Toronto   28     135.0
103    Jana       Prague   33     121.5
104      Yi     Shanghai   34     120.0
105   Robin   Manchester   38     102.0
106    Amal        Cairo   31      91.5
107    Nori        Osaka   37     126.0

In [65]:
students_df["py-score"]=list(map(lambda x: x+10,students_df["py-score"]))

In [ ]:
students_df["py-score"] +=  10

In [ ]:
students_df

In [ ]:
students_df["py-score"]= students_df["py-score"] + students_df["age"]

In [ ]:
students_df

In [ ]:
students_df.columns = ['index', 'name', 'city', 'age', 'py-score']

In [ ]:
students_df

In [ ]:
students_df[["age","py-score"]]

In [ ]:
type(students_df[["age"]])

### Inserting/deleteing rows

In [ ]:
students_df.columns

In [ ]:
students_df  = students_df[['name', 'city', 'age', 'py-score']]
students_df

In [71]:
Ronald = pd.Series(data=['Ronald', 'Berlin', 34, 79],
                 index=students_df.columns[0:4])
students_df= students_df.append(Ronald,ignore_index=True)
students_df

C:\Users\Phylanx\AppData\Local\Temp\ipykernel_17104\2686564188.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  students_df= students_df.append(Ronald,ignore_index=True)

     name         city  age  py-score
0  Xavier  Mexico City   41     132.0
1     Ann      Toronto   28     135.0
2    Jana       Prague   33     121.5
3      Yi     Shanghai   34     120.0
4   Robin   Manchester   38     102.0
5    Amal        Cairo   31      91.5
6    Nori        Osaka   37     126.0
7  Ronald       Berlin   34      79.0

In [74]:
students_df.iloc[7,:]

name        Ronald
city        Berlin
age             34
py-score      79.0
Name: 7, dtype: object

In [ ]:
Ronald = pd.Series(data=['Ronald', 'Berlin', 34, 79],
                 index=students_df.columns[0:4],name=21)

In [ ]:
students_df=students_df.append(Ronald)

In [ ]:
students_df

In [81]:
students_df.drop(labels=[7],inplace=True)

In [ ]:
students_df

### Inserting/Deleting columns

In [82]:
#print('df[js-score] = np.array([71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0])')
students_df['js-score'] =[71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0]
students_df

     name         city  age  py-score  js-score
0  Xavier  Mexico City   41     132.0      71.0
1     Ann      Toronto   28     135.0      95.0
2    Jana       Prague   33     121.5      88.0
3      Yi     Shanghai   34     120.0      79.0
4   Robin   Manchester   38     102.0      91.0
5    Amal        Cairo   31      91.5      91.0
6    Nori        Osaka   37     126.0      80.0

In [83]:
students_df['py-score-updated'] = students_df['py-score'] * 10

In [ ]:
students_df

### Inserting in a specific location

In [89]:
#print('df.insert(loc=4, column=js-score,value=np.array([86.0, 81.0, 78.0, 88.0, 74.0, 70.0, 81.0]))')
students_df.insert(loc=4, column='django-score',
          value=np.array([70, 74, 78, 56, 66, 78, 81.0]))
students_df

,name,city,age,py-score,django-score,js-score,py-score-updated
0,Xavier,Mexico City,41,132.0,70.0,71.0,1320.0
1,Ann,Toronto,28,135.0,74.0,95.0,1350.0
2,Jana,Prague,33,121.5,78.0,88.0,1215.0
3,Yi,Shanghai,34,120.0,56.0,79.0,1200.0
4,Robin,Manchester,38,102.0,66.0,91.0,1020.0
5,Amal,Cairo,31,91.5,78.0,91.0,915.0
6,Nori,Osaka,37,126.0,81.0,80.0,1260.0

### dropping specific column

In [91]:
## axis= 0 dropping by row,  axis=1. ropping by column
students_df = students_df.drop(labels=['django-score'], axis=1)

In [98]:
students_df

     name         city  age  py-score  js-score  py-score-updated
0  Xavier  Mexico City   41     132.0      71.0            1320.0
1     Ann      Toronto   28     135.0      95.0            1350.0
2    Jana       Prague   33     121.5      88.0            1215.0
3      Yi     Shanghai   34     120.0      79.0            1200.0
4   Robin   Manchester   38     102.0      91.0            1020.0
5    Amal        Cairo   31      91.5      91.0             915.0
6    Nori        Osaka   37     126.0      80.0            1260.0

### Filtering/Boolean Indexing

In [95]:
students_df["py-score"] >= 100

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: py-score, dtype: bool

In [96]:
students_df[students_df["py-score"]>=200]

Empty DataFrame
Columns: [name, city, age, py-score, js-score, py-score-updated]
Index: []

In [100]:
very_good_students_filter = students_df['py-score'] >= 100
very_good_students_filter

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: py-score, dtype: bool

In [101]:
students_df[very_good_students_filter]

     name         city  age  py-score  js-score  py-score-updated
0  Xavier  Mexico City   41     132.0      71.0            1320.0
1     Ann      Toronto   28     135.0      95.0            1350.0
2    Jana       Prague   33     121.5      88.0            1215.0
3      Yi     Shanghai   34     120.0      79.0            1200.0
4   Robin   Manchester   38     102.0      91.0            1020.0
6    Nori        Osaka   37     126.0      80.0            1260.0

### Creating powerful filters with Logical operators AND, OR, NOT, XOR

In [102]:
#print('df[(df[py-score] >= 80) & (df[js-score] >= 80)]')
students_df[(students_df['py-score'] >= 200) | (students_df['js-score'] >= 80)]

    name        city  age  py-score  js-score  py-score-updated
1    Ann     Toronto   28     135.0      95.0            1350.0
2   Jana      Prague   33     121.5      88.0            1215.0
4  Robin  Manchester   38     102.0      91.0            1020.0
5   Amal       Cairo   31      91.5      91.0             915.0
6   Nori       Osaka   37     126.0      80.0            1260.0

## using value counts  function

In [104]:
people_df=pd.read_csv("data/people.csv")
people_df

    name  age country
0    Pol   22      ES
1   Javi   20      ES
2  Maria   23      AR
3   Anna   24      FR
4   Anna   24      UK
5   Javi   30      MA
6    Dog    2      XX

In [105]:
people_df["country"].value_counts()

ES    2
AR    1
FR    1
UK    1
MA    1
XX    1
Name: country, dtype: int64